app/controllers/service_type_name_controller.rb

  def create
  	#debugger
   @servicetypename = ServiceTypeName.new(service_params)
     #respond_to do |format|
     if @servicetypename.save
---
INSERT INTO `service_type_names` (`servicetypeId`, `ServiceName`, `ServiceType`, `Servicedescription`, `ServiceStatus`, `created_at`, `updated_at`) VALUES (1, 'text', 0, 'hello', 0, '2020-05-14 15:31:59.416074', '2020-05-14 15:31:59.416074')

  def show
    @servicetypename = ServiceTypeName.find(params[:id])
---
SELECT `service_type_names`.* FROM `service_type_names` WHERE `service_type_names`.`id` = 1 LIMIT 1

  def index
	  @servicetypenames = ServiceTypeName.all
---
SELECT `service_type_names`.* FROM `service_type_names`

  def edit
    @servicetypename = ServiceTypeName.find(params[:id])
---
SELECT `service_type_names`.* FROM `service_type_names` WHERE `service_type_names`.`id` = 2 LIMIT 1

  def update
    @servicetypename = ServiceTypeName.find(params[:id])
   if @servicetypename.update(service_params)
---
SELECT `service_type_names`.* FROM `service_type_names` WHERE `service_type_names`.`id` = 4 LIMIT 1
UPDATE `service_type_names` SET `service_type_names`.`servicetypeId` = 112, `service_type_names`.`ServiceName` = '212', `service_type_names`.`ServiceType` = 23, `service_type_names`.`Servicedescription` = 'f gfgbf', `service_type_names`.`ServiceStatus` = 0, `service_type_names`.`updated_at` = '2020-05-14 18:59:17.123556' WHERE `service_type_names`.`id` = 1

 def destroy
  #debugger
   @servicetypename = ServiceTypeName.find(params[:id])
   @servicetypename.destroy
---
SELECT `service_type_names`.* FROM `service_type_names` WHERE `service_type_names`.`id` = 1 LIMIT 1
DELETE FROM `service_type_names` WHERE `service_type_names`.`id` = 1

  def all_item
    @servicetypename = ServiceTypeName.all
---
SELECT `service_type_names`.* FROM `service_type_names`