app/controllers/user_info_controller.rb

  def create_user
  	#debugger
    @userinfo = UserInfo.new(user_params)
     if @userinfo.save
---
INSERT INTO `user_infos` (`UserID`, `PhoneNumber`, `Gender`, `Age`, `UserType`, `AcountCreationDate`, `IsAcountActive`, `UserCity`, `UserArea`, `PinCode`, `LocalAddress`, `Latitute`, `Longitude`, `GovtIDVerified`, `OTP`, `ServiceType`, `created_at`, `updated_at`) VALUES (1, '123556789', 'f', '23', 1, '2020-05-16 00:00:00', TRUE, 'nn', 'mm', '343434', 'dffdfd', 34, 32323, TRUE, '3232', '32323', '2020-05-16 16:04:14.871990', '2020-05-16 16:04:14.871990')

 def edit_user
    @userinfo = UserInfo.find(params[:id])
---
SELECT `user_infos`.* FROM `user_infos` WHERE `user_infos`.`id` = 1 LIMIT 1

  def update_user
    @userinfo = UserInfo.find(params[:id])
   if @userinfo.update(user_params)
---
SELECT `user_infos`.* FROM `user_infos` WHERE `user_infos`.`id` = 1 LIMIT 1
UPDATE `user_infos` SET `user_infos`.`UserID` = 1, `user_infos`.`PhoneNumber` = '0123556789', `user_infos`.`Gender` = 'Female', `user_infos`.`Age` = '20', `user_infos`.`UserType` = 13, `user_infos`.`AcountCreationDate` = '2020-05-17 00:00:00', `user_infos`.`IsAcountActive` = TRUE, `user_infos`.`UserCity` = 'nn3434', `user_infos`.`UserArea` = '4334', `user_infos`.`PinCode` = '343434', `user_infos`.`LocalAddress` = 'dffdfd', `user_infos`.`Latitute` = 34, `user_infos`.`Longitude` = 34343, `user_infos`.`GovtIDVerified` = TRUE, `user_infos`.`OTP` = '3434', `user_infos`.`ServiceType` = '111', `user_infos`.`updated_at` = '2020-05-17 04:38:59.565933' WHERE `user_infos`.`id` = 8

  def index_user
	@userinfos = UserInfo.all
---
SELECT `user_infos`.* FROM `user_infos`

  def destroy_user
  #debugger
   @userinfo = UserInfo.find(params[:id])
   @userinfo.destroy
---
SELECT `user_infos`.* FROM `user_infos` WHERE `user_infos`.`id` = 1 LIMIT 1
DELETE FROM `user_infos` WHERE `user_infos`.`id` = 1

  def all_user_item
    # puts "--------"
    # puts "Mohar"
    # puts "#{params}"
    # puts"++++++++++"
    # @userinfo = UserInfo.find(params[:id])
    # puts "#{@userinfo}"
    # puts"=========="

    items = []
    responses = UserInfo.all
    responses.each do |resp|
---
SELECT `user_infos`.* FROM `user_infos`

  def one_user_info
     userArray = []
    @userinfo = UserInfo.find_by_id(params[:id])
---
SELECT `user_infos`.* FROM `user_infos` WHERE `user_infos`.`id` IS NULL LIMIT 1

    @userinfo.OTP = @otp
    @userinfo.ServiceType = @servicetype

    if @userinfo.save
---
INSERT INTO `user_infos` (`PhoneNumber`, `Gender`, `Age`, `UserType`, `created_at`, `updated_at`) VALUES ('12334', 'm', '44', 0, '2020-05-18 17:56:41.547293', '2020-05-18 17:56:41.547293')
UPDATE `user_infos` SET `user_infos`.`PhoneNumber` = '222244', `user_infos`.`Gender` = 'm', `user_infos`.`Age` = '24', `user_infos`.`UserType` = 1, `user_infos`.`updated_at` = '2020-05-21 07:38:08.075843' WHERE `user_infos`.`id` = 14

  def updateNewUser
    #debugger
    response = {}

      @phoneNumber = params[:phoneNumber]
      @gender = params[:gender]
      @age = params[:age]
      @userType = params[:userType]
      attributes = {:PhoneNumber => @phoneNumber,:Gender => @gender,:Age => @age ,:UserType => @userType}
      @userinfo = UserInfo.find_by_id(params[:id])
     # @userinfo.PhoneNumber = @phoneNumber
     # @userinfo.Gender = @gender
     # @userinfo.Age = @age
     # @userinfo.UserType = @userType
     #debugger
    if @userinfo.update_attributes(attributes)
---
SELECT `user_infos`.* FROM `user_infos` WHERE `user_infos`.`id` = 5
UPDATE `user_infos` SET `user_infos`.`PhoneNumber` = NULL, `user_infos`.`Age` = NULL, `user_infos`.`Gender` = NULL, `user_infos`.`updated_at` = '2020-05-21 11:48:47.852606' WHERE `user_infos`.`id` = 5

  def finduserbyname
  @userinfo = UserInfo.find_by(params[:PhoneNumber])
---
SELECT `user_infos`.* FROM `user_infos` WHERE (01234yygtyu) LIMIT 1