app/models/user_info.rb

 def self.get_all_userinfo
    points = UserInfo.select('UserID, PhoneNumber, Gender, Age, UserType, AcountCreationDate, LastUpdate, IsAcountActive, UserCity, UserArea, PinCode, LocalAddress, Latitute, Longitude, GovtIDVerified, ServiceType')
    array = []
    points.each do |point|
---
SELECT UserID, PhoneNumber, Gender, Age, UserType, AcountCreationDate, LastUpdate, IsAcountActive, UserCity, UserArea, PinCode, LocalAddress, Latitute, Longitude, GovtIDVerified, ServiceType FROM `user_infos`